# HandOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..HandOrientation Property
FamilyInstance Class See Also
---
Property to get the orientation of family instance hand.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ HandOrientation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HandOrientation As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ HandOrientation {
	XYZ^ get ();
}
```

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace